In [181]:
import pandas as pd

In [182]:
import numpy as np

In [42]:
np.random.seed(1)

In [183]:
df = pd.DataFrame(np.random.randint(1,100,[5,4])
                 , index = 'a b c d e'.split()
                 , columns = 'w x y z'.split())

In [44]:
df

    w   x   y   z
a  38  13  73  10
b  76   6  80  65
c  17   2  77  72
d   7  26  51  21
e  19  85  12  29

In [45]:
df['I'] = [1,2,3,4,5]

In [46]:
df

    w   x   y   z  I
a  38  13  73  10  1
b  76   6  80  65  2
c  17   2  77  72  3
d   7  26  51  21  4
e  19  85  12  29  5

In [47]:
df['J'] = np.zeros(len(df.index))

In [30]:
df.columns

Index(['w', 'x', 'y', 'z', 'I'], dtype='object')

In [31]:
df.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [32]:
len(df.index)

5

In [48]:
df

    w   x   y   z  I    J
a  38  13  73  10  1  0.0
b  76   6  80  65  2  0.0
c  17   2  77  72  3  0.0
d   7  26  51  21  4  0.0
e  19  85  12  29  5  0.0

In [185]:
df['Sum'] = df['w'] + df['x']

In [53]:
df

    w   x   y   z  I    J  Sum
a  38  13  73  10  1  0.0   51
b  76   6  80  65  2  0.0   82
c  17   2  77  72  3  0.0   19
d   7  26  51  21  4  0.0   33
e  19  85  12  29  5  0.0  104

In [187]:
df['N'] = df['Sum'].apply(lambda x: 'xyz' if x<50 else False)

In [188]:
df

    w   x   y   z  Sum      N
a  30  15  51  69   45    xyz
b  88  88  95  97  176  False
c  87  14  10   8  101  False
d  64  62  23  58  126  False
e   2   1  61  82    3    xyz

In [58]:
df.drop('N', axis = 1, inplace = True)

In [59]:
df

    w   x   y   z  I    J  Sum
a  38  13  73  10  1  0.0   51
b  76   6  80  65  2  0.0   82
c  17   2  77  72  3  0.0   19
d   7  26  51  21  4  0.0   33
e  19  85  12  29  5  0.0  104

In [66]:
df.loc['f'] = np.zeros(len(df.columns))

In [67]:
df

      w     x     y     z    I    J    Sum
a  38.0  13.0  73.0  10.0  1.0  0.0   51.0
b  76.0   6.0  80.0  65.0  2.0  0.0   82.0
c  17.0   2.0  77.0  72.0  3.0  0.0   19.0
d   7.0  26.0  51.0  21.0  4.0  0.0   33.0
e  19.0  85.0  12.0  29.0  5.0  0.0  104.0
f   0.0   0.0   0.0   0.0  0.0  0.0    0.0

In [68]:
df.loc['c']

w      17.0
x       2.0
y      77.0
z      72.0
I       3.0
J       0.0
Sum    19.0
Name: c, dtype: float64

In [69]:
df.loc['c'] = [1,1,1,1,1,1,1]

In [70]:
df

      w     x     y     z    I    J    Sum
a  38.0  13.0  73.0  10.0  1.0  0.0   51.0
b  76.0   6.0  80.0  65.0  2.0  0.0   82.0
c   1.0   1.0   1.0   1.0  1.0  1.0    1.0
d   7.0  26.0  51.0  21.0  4.0  0.0   33.0
e  19.0  85.0  12.0  29.0  5.0  0.0  104.0
f   0.0   0.0   0.0   0.0  0.0  0.0    0.0

In [71]:
df.loc['f'] = [1,2,3,4,5,6,7]

In [72]:
df

      w     x     y     z    I    J    Sum
a  38.0  13.0  73.0  10.0  1.0  0.0   51.0
b  76.0   6.0  80.0  65.0  2.0  0.0   82.0
c   1.0   1.0   1.0   1.0  1.0  1.0    1.0
d   7.0  26.0  51.0  21.0  4.0  0.0   33.0
e  19.0  85.0  12.0  29.0  5.0  0.0  104.0
f   1.0   2.0   3.0   4.0  5.0  6.0    7.0

In [73]:
df.loc['b','x']

6.0

In [74]:
df.loc['b','x'] = 99

In [75]:
df

      w     x     y     z    I    J    Sum
a  38.0  13.0  73.0  10.0  1.0  0.0   51.0
b  76.0  99.0  80.0  65.0  2.0  0.0   82.0
c   1.0   1.0   1.0   1.0  1.0  1.0    1.0
d   7.0  26.0  51.0  21.0  4.0  0.0   33.0
e  19.0  85.0  12.0  29.0  5.0  0.0  104.0
f   1.0   2.0   3.0   4.0  5.0  6.0    7.0

In [78]:
df.loc[ ['a','b'] , 'x':'z'] = [ [1,2,3 ], [4,5,6]]

In [79]:
df

      w     x     y     z    I    J    Sum
a  38.0   1.0   2.0   3.0  1.0  0.0   51.0
b  76.0   4.0   5.0   6.0  2.0  0.0   82.0
c   1.0   1.0   1.0   1.0  1.0  1.0    1.0
d   7.0  26.0  51.0  21.0  4.0  0.0   33.0
e  19.0  85.0  12.0  29.0  5.0  0.0  104.0
f   1.0   2.0   3.0   4.0  5.0  6.0    7.0

In [80]:
df.loc[ ['a','b'] , 'x':'z']

     x    y    z
a  1.0  2.0  3.0
b  4.0  5.0  6.0

In [81]:
df.drop('f',axis = 0)

      w     x     y     z    I    J    Sum
a  38.0   1.0   2.0   3.0  1.0  0.0   51.0
b  76.0   4.0   5.0   6.0  2.0  0.0   82.0
c   1.0   1.0   1.0   1.0  1.0  1.0    1.0
d   7.0  26.0  51.0  21.0  4.0  0.0   33.0
e  19.0  85.0  12.0  29.0  5.0  0.0  104.0

In [82]:
df.drop('f',axis = 0, inplace = True)

In [83]:
df

      w     x     y     z    I    J    Sum
a  38.0   1.0   2.0   3.0  1.0  0.0   51.0
b  76.0   4.0   5.0   6.0  2.0  0.0   82.0
c   1.0   1.0   1.0   1.0  1.0  1.0    1.0
d   7.0  26.0  51.0  21.0  4.0  0.0   33.0
e  19.0  85.0  12.0  29.0  5.0  0.0  104.0

In [ ]:
df.drop('I', axis = 1, inplace = True)
df.drop('J', axis = 1, inplace = True)
df.drop('Sum', axis = 1, inplace = True)

In [88]:
df

      w     x     y     z
a  38.0   1.0   2.0   3.0
b  76.0   4.0   5.0   6.0
c   1.0   1.0   1.0   1.0
d   7.0  26.0  51.0  21.0
e  19.0  85.0  12.0  29.0

In [92]:
df.rename(columns = {'w':'pi','x':'rad'})

     pi   rad     y     z
a  38.0   1.0   2.0   3.0
b  76.0   4.0   5.0   6.0
c   1.0   1.0   1.0   1.0
d   7.0  26.0  51.0  21.0
e  19.0  85.0  12.0  29.0

In [93]:
df

      w     x     y     z
a  38.0   1.0   2.0   3.0
b  76.0   4.0   5.0   6.0
c   1.0   1.0   1.0   1.0
d   7.0  26.0  51.0  21.0
e  19.0  85.0  12.0  29.0

In [94]:
df.rename(columns = {'w':'pi','x':'rad'}, inplace = True)

In [95]:
df

     pi   rad     y     z
a  38.0   1.0   2.0   3.0
b  76.0   4.0   5.0   6.0
c   1.0   1.0   1.0   1.0
d   7.0  26.0  51.0  21.0
e  19.0  85.0  12.0  29.0

In [96]:
df.rename(index = {'a':'a1','b':'a2'})

      pi   rad     y     z
a1  38.0   1.0   2.0   3.0
a2  76.0   4.0   5.0   6.0
c    1.0   1.0   1.0   1.0
d    7.0  26.0  51.0  21.0
e   19.0  85.0  12.0  29.0

In [97]:
df.reset_index()

  index    pi   rad     y     z
0     a  38.0   1.0   2.0   3.0
1     b  76.0   4.0   5.0   6.0
2     c   1.0   1.0   1.0   1.0
3     d   7.0  26.0  51.0  21.0
4     e  19.0  85.0  12.0  29.0

In [98]:
df

     pi   rad     y     z
a  38.0   1.0   2.0   3.0
b  76.0   4.0   5.0   6.0
c   1.0   1.0   1.0   1.0
d   7.0  26.0  51.0  21.0
e  19.0  85.0  12.0  29.0

In [99]:
df.reset_index(inplace = True)

In [100]:
df

  index    pi   rad     y     z
0     a  38.0   1.0   2.0   3.0
1     b  76.0   4.0   5.0   6.0
2     c   1.0   1.0   1.0   1.0
3     d   7.0  26.0  51.0  21.0
4     e  19.0  85.0  12.0  29.0

In [101]:
df.set_index('index')

         pi   rad     y     z
index
a      38.0   1.0   2.0   3.0
b      76.0   4.0   5.0   6.0
c       1.0   1.0   1.0   1.0
d       7.0  26.0  51.0  21.0
e      19.0  85.0  12.0  29.0

In [103]:
df.set_index('index',inplace = True)

In [104]:
df

         pi   rad     y     z
index
a      38.0   1.0   2.0   3.0
b      76.0   4.0   5.0   6.0
c       1.0   1.0   1.0   1.0
d       7.0  26.0  51.0  21.0
e      19.0  85.0  12.0  29.0

In [105]:
df.loc['a']

pi     38.0
rad     1.0
y       2.0
z       3.0
Name: a, dtype: float64

In [106]:
df1 = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']}
                   , index = [0,1,2,4])
df2 = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K4'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']})

In [107]:
df1

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
4  K3  A3  B3

In [108]:
df2

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K4  C3  D3

In [109]:
display(df1,df2)

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
4  K3  A3  B3

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K4  C3  D3

In [110]:
pd.concat([df1,df2])

  key    A    B    C    D
0  K0   A0   B0  NaN  NaN
1  K1   A1   B1  NaN  NaN
2  K2   A2   B2  NaN  NaN
4  K3   A3   B3  NaN  NaN
0  K0  NaN  NaN   C0   D0
1  K1  NaN  NaN   C1   D1
2  K2  NaN  NaN   C2   D2
3  K4  NaN  NaN   C3   D3

In [111]:
pd.concat([df1,df2],axis = 1)

   key    A    B  key    C    D
0   K0   A0   B0   K0   C0   D0
1   K1   A1   B1   K1   C1   D1
2   K2   A2   B2   K2   C2   D2
4   K3   A3   B3  NaN  NaN  NaN
3  NaN  NaN  NaN   K4   C3   D3

In [119]:
d = {
    'A' : [1,2,np.nan,5],
    'B' : [5,np.nan,np.nan,np.nan],
    'C' : [1,2,3,4]
}
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3
3  5.0  NaN  4

In [120]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [124]:
df.dropna(thresh = 3)

     A    B  C
0  1.0  5.0  1

In [150]:
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
3  5.0  NaN  4

In [144]:
df.dropna(thresh = len(df.columns)-2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3
3  5.0  NaN  4

In [155]:
df.dropna(thresh = len(df.columns)-1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
3  5.0  NaN  4

In [146]:
df.dropna(axis=1)

   C
0  1
1  2
2  3
3  4

In [156]:
df[df['A'].isnull()]

    A   B  C
2 NaN NaN  3

In [157]:
df[df['A'].notnull()]

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
3  5.0  NaN  4

In [159]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3
3  5.0  NaN  4

In [161]:
df.loc[1,'B'] = 100

In [162]:
df

     A      B  C
0  1.0    5.0  1
1  2.0  100.0  2
2  NaN    NaN  3
3  5.0    NaN  4

In [164]:
df['B'].fillna(value = 500)

0      5.0
1    100.0
2    500.0
3    500.0
Name: B, dtype: float64

In [166]:
df['B'].mean()

52.5

In [171]:
df['B'].fillna(value = df['B'].mean())

0      5.0
1    100.0
2     52.5
3     52.5
Name: B, dtype: float64

In [172]:
df

     A      B  C
0  1.0    5.0  1
1  2.0  100.0  2
2  NaN   52.5  3
3  5.0   52.5  4

In [174]:
df.fillna({'B':df['B'].mean(),'A':0})

     A      B  C
0  1.0    5.0  1
1  2.0  100.0  2
2  0.0   52.5  3
3  5.0   52.5  4